In [56]:
import pandas as pd
import numpy as np

In [57]:
cats = {
    'name': ['Bob', 'Jessica', 'Mary', 'John', 'Mel'],
    'color': ['green', 'black', 'red', 'red', 'blue'],
    'age': [24, 53, 23, 48, 70],
    'chunkiness': [1, 5, 2, 6, 7]
}

cats_df = pd.DataFrame(cats)
cats_df

      name  color  age  chunkiness
0      Bob  green   24           1
1  Jessica  black   53           5
2     Mary    red   23           2
3     John    red   48           6
4      Mel   blue   70           7

In [58]:
cats_df = pd.DataFrame(cats, index=['bo', 'je', 'ma', 'jo', 'me'])
cats_df

       name  color  age  chunkiness
bo      Bob  green   24           1
je  Jessica  black   53           5
ma     Mary    red   23           2
jo     John    red   48           6
me      Mel   blue   70           7

In [60]:
cats_df = pd.DataFrame(np.array([['Bob', 'Jessica', 'Mary', 'John', 'Mel'],
                                 ['green', 'black', 'red', 'red', 'blue'],
                                 [24, 53, 23, 48, 70],
                                 [1, 5, 2, 6, 7]]).T,
                       index=['bo', 'je', 'ma', 'jo', 'me'],
                       columns=['name', 'color', 'age', 'chunkiness'])
cats_df

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2
jo     John    red  48          6
me      Mel   blue  70          7

In [61]:
cats_df.columns

Index(['name', 'color', 'age', 'chunkiness'], dtype='object')

In [62]:
cats_df.index

Index(['bo', 'je', 'ma', 'jo', 'me'], dtype='object')

In [65]:
cats_df.values

array([['Bob', 'green', '24', '1'],
       ['Jessica', 'black', '53', '5'],
       ['Mary', 'red', '23', '2'],
       ['John', 'red', '48', '6'],
       ['Mel', 'blue', '70', '7']], dtype=object)

In [66]:
cats_df

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2
jo     John    red  48          6
me      Mel   blue  70          7

In [67]:
cats_df['color']

bo    green
je    black
ma      red
jo      red
me     blue
Name: color, dtype: object

In [69]:
cats_df.color

bo    green
je    black
ma      red
jo      red
me     blue
Name: color, dtype: object

In [70]:
cats_df.loc['jo']

name          John
color          red
age             48
chunkiness       6
Name: jo, dtype: object

In [72]:
cats_df.loc[['je', 'ma']]

       name  color age chunkiness
je  Jessica  black  53          5
ma     Mary    red  23          2

In [79]:
cats_df[0:3]

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2

In [80]:
cats_df

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2
jo     John    red  48          6
me      Mel   blue  70          7

In [81]:
cats_df['age']['je']

'53'

In [82]:
cats_df.index.name = 'id'
cats_df.columns.name = 'attribute'
cats_df

attribute     name  color age chunkiness
id
bo             Bob  green  24          1
je         Jessica  black  53          5
ma            Mary    red  23          2
jo            John    red  48          6
me             Mel   blue  70          7

In [87]:
cats_df['new'] = [1, 2, 3, 4, 5]
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6    1
je         Jessica  black  53           2    2
ma            Mary    red  23           3    3
jo            John    red  48           5    4
me             Mel   blue  70           1    5

In [85]:
cats_df['new'] = 0
cats_df

attribute     name  color age chunkiness  new
id
bo             Bob  green  24          1    0
je         Jessica  black  53          5    0
ma            Mary    red  23          2    0
jo            John    red  48          6    0
me             Mel   blue  70          7    0

In [86]:
cats_df.chunkiness = [6, 2, 3, 5, 1]
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6    0
je         Jessica  black  53           2    0
ma            Mary    red  23           3    0
jo            John    red  48           5    0
me             Mel   blue  70           1    0

In [88]:
cats_df.new = pd.Series([1, 2, 3, 4, 5], index=['bo', 'je', 'ma', 'jo', 'me'])
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6    1
je         Jessica  black  53           2    2
ma            Mary    red  23           3    3
jo            John    red  48           5    4
me             Mel   blue  70           1    5

In [90]:
cats_df.new = pd.Series([1, 2, 3, 4, 5], index=['je', 'bo', 'ma', 'jo', 'io'])
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6  2.0
je         Jessica  black  53           2  1.0
ma            Mary    red  23           3  3.0
jo            John    red  48           5  4.0
me             Mel   blue  70           1  NaN

In [92]:
cats_df['new']['me'] = 999
cats_df

/var/folders/5z/_4ymrqb55gl_n9nt577w6kkm0000gn/T/ipykernel_22154/730843231.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  cats_df['new']['me'] = 999
/var/folders/5z/_4ymrqb55gl_n9nt577w6kkm0000gn/T/ipykernel_22154/730843231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cats_df['new']['me'] = 999

attribute     name  color  age  chunkiness    new
id
bo             Bob  green   24           6    2.0
je         Jessica  black   53           2    1.0
ma            Mary    red   23           3    3.0
jo            John    red   48           5    4.0
me             Mel   blue  999           1  999.0

In [94]:
cats_df.loc['me', 'new'] = 888

In [95]:
cats_df

attribute     name  color  age  chunkiness    new
id
bo             Bob  green   24           6    2.0
je         Jessica  black   53           2    1.0
ma            Mary    red   23           3    3.0
jo            John    red   48           5    4.0
me             Mel   blue  999           1  888.0

In [98]:
cats_df.isin(['24', 'Jessica', 888.0, 'Hello'])

attribute   name  color    age  chunkiness    new
id
bo         False  False   True       False  False
je          True  False  False       False  False
ma         False  False  False       False  False
jo         False  False  False       False  False
me         False  False  False       False   True

In [99]:
cats_df[cats_df.isin(['24', 'Jessica', 888.0, 'Hello'])]

attribute     name color  age  chunkiness    new
id
bo             NaN   NaN   24         NaN    NaN
je         Jessica   NaN  NaN         NaN    NaN
ma             NaN   NaN  NaN         NaN    NaN
jo             NaN   NaN  NaN         NaN    NaN
me             NaN   NaN  NaN         NaN  888.0

In [101]:
del cats_df['new']
cats_df

attribute     name  color  age  chunkiness
id
bo             Bob  green   24           6
je         Jessica  black   53           2
ma            Mary    red   23           3
jo            John    red   48           5
me             Mel   blue  999           1

In [104]:
del cats_df['chunkiness']

In [105]:
cats_df

attribute     name  color  age
id
bo             Bob  green   24
je         Jessica  black   53
ma            Mary    red   23
jo            John    red   48
me             Mel   blue  999

In [106]:
frame = pd.DataFrame(
    np.arange(16).reshape((4, 4)),
    index=['red', 'blue', 'yellow', 'white'],
    columns=['ball', 'pen', 'pencil', 'paper']
)
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [107]:
mask = frame < 8

         ball    pen  pencil  paper
red      True   True    True   True
blue     True   True    True   True
yellow  False  False   False  False
white   False  False   False  False

In [110]:
frame[frame < 8]

        ball  pen  pencil  paper
red      0.0  1.0     2.0    3.0
blue     4.0  5.0     6.0    7.0
yellow   NaN  NaN     NaN    NaN
white    NaN  NaN     NaN    NaN

In [112]:
nestdict = {
    'red': {2012: 22, 2013: 33, 2077: 44},
    'white': {2011: 13, 2012: 22, 2013: 16},
    'blue': {2011: 17, 2012: 27, 2013: 18}
}
frame2 = pd.DataFrame(nestdict)
frame2

       red  white  blue
2012  22.0   22.0  27.0
2013  33.0   16.0  18.0
2077  44.0    NaN   NaN
2011   NaN   13.0  17.0

In [113]:
frame2.transpose()

       2012  2013  2077  2011
red    22.0  33.0  44.0   NaN
white  22.0  16.0   NaN  13.0
blue   27.0  18.0   NaN  17.0

In [114]:
frame2.T

       2012  2013  2077  2011
red    22.0  33.0  44.0   NaN
white  22.0  16.0   NaN  13.0
blue   27.0  18.0   NaN  17.0

In [119]:
frame2.red.idxmin()

np.int64(2012)

In [120]:
frame2.idxmin()

red      2012
white    2011
blue     2011
dtype: int64

In [121]:
frame2.idxmax()

red      2077
white    2012
blue     2012
dtype: int64

In [122]:
frame = pd.DataFrame({
    'color': ['blue', 'green', 'yellow', 'red', 'white'],
    'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
    'price': [1.2, 1.0, 0.6, 0.9, 1.7]
}, index=[1, 1, 3, 2, 4])
frame

    color  object  price
1    blue    ball    1.2
1   green     pen    1.0
3  yellow  pencil    0.6
2     red   paper    0.9
4   white     mug    1.7

In [123]:
frame.loc[1]

   color object  price
1   blue   ball    1.2
1  green    pen    1.0

In [124]:
frame.index.is_unique

False

In [125]:
frame = pd.DataFrame({
    'color': ['blue', 'green', 'yellow', 'red', 'white'],
    'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
    'price': [1.2, 1.0, 0.6, 0.9, 1.7]
})
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [126]:
frame.index.is_unique

True